Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.VisibilityEnum Enumeration
 The visibility type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum VisibilityEnum
Public Enumeration VisibilityEnum
Members
Member name | Value | Description
HIDDEN | 0 |  The reference model is invisible in the model.
VISIBLE | 1 |  The reference model is visible in the model.
See Also
Reference
Tekla.Structures.Model Namespace